Revit 2024 API
BuiltInFailures.StairRampFailures.NoCurvesInRailing Property
 Railing Sketch has no Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoCurvesInRailing { get; }
Visual Basic
Public Shared ReadOnly Property NoCurvesInRailing As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoCurvesInRailing {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace